<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the Google Chrome Enterprise Package and imports it into Intune.</string>
		<key>Identifier</key>
		<string>com.github.stevekueng.intune.googlechromepkg</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GoogleChrome</string>
			<key>description</key>
			<string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Chrome</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.4.1</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.download.googlechromepkg</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/GoogleChrome.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/Google Chrome.app/Contents/Info.plist</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>version</string>
						<key>CFBundleIdentifier</key>
						<string>bundleID</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PlistReader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_app</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/Google Chrome.app</string>
				</dict>
				<key>Processor</key>
				<string>com.github.haircut.processors/AppIconExtractor</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>item_path</key>
					<string>%pathname%</string>
					<key>displayname</key>
					<string>%display_name%</string>
					<key>description</key>
					<string>%description%</string>
					<key>publisher</key>
					<string>%developer%</string>
					<key>version</key>
					<string>%version%</string>
					<key>build</key>
					<string>%version%</string>
					<key>bundleID</key>
					<string>%bundleID%</string>
					<key>icon</key>
					<string>%app_icon_path%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.stevekueng.processors/IntuneImporter</string>
			</dict>
		</array>
	</dict>
</plist>
